KanatERPSukhova.КанатАдаптация/src/Catalogs/ГосударственныеКонтракты/ГосударственныеКонтракты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="150b7e79-b2ba-4802-8c98-0fb39df77a4a">
  <name>ГосударственныеКонтракты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="44f46d80-32d9-47d2-94e4-81c4f7139f4a">
    <name>НомерИГК</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb40c87b-9005-456d-b42f-f3b6a887cee5">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2cddc38e-54ee-405d-ab65-b99a6675c8d5">
    <name>ПредметКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06d38dba-215d-40b4-8d80-1a415a672df8">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3012a7-a307-43fa-99df-9112aa5d6559">
    <name>ДатаЗаключения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45ba24f8-10ba-476f-9192-af80cb30a623">
    <name>ВнутреннийИдентификаторЕИС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8cdf14cd-5534-4834-8b09-97d008f577ef">
    <name>ТипНаправленияДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Enums/ТипыНаправленийДеятельности/ТипыНаправленийДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c48660c5-edbd-4c32-8897-06db07cbe865">
  <name>ТипыНаправленийДеятельности</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c187a341-c4b3-44aa-aab0-1360e9444df6">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="58686353-1d16-4f22-bcab-35265a7b5744">
    <name>КонтрактГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ГосударственныеКонтракты/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура КАНАТ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив;

	Если Не ЗначениеЗаполнено(ВнутреннийИдентификаторЕИС) Тогда
		ПроверяемыеРеквизиты.Добавить("Состояние");
		ПроверяемыеРеквизиты.Добавить("ДатаЗаключения");
		ПроверяемыеРеквизиты.Добавить("ГодОкончанияСрокаДействия");

		Если ТипНаправленияДеятельности = Перечисления.ТипыНаправленийДеятельности.КонтрактГОЗ Тогда
			ПроверяемыеРеквизиты.Добавить("УполномоченныйБанк");
			#Удаление
			ПроверяемыеРеквизиты.Добавить("НомерГОЗ");
			#КонецУдаления
			ПроверяемыеРеквизиты.Добавить("КодСпособаОпределенияПоставщика");
			ПроверяемыеРеквизиты.Добавить("КодГосударственногоЗаказчика");
			ПроверяемыеРеквизиты.Добавить("ПорядковыйНомер");
			ПроверяемыеРеквизиты.Добавить("ДополнительныеРазряды");
		КонецЕсли;
	КонецЕсли;

	Если ТипНаправленияДеятельности = Перечисления.ТипыНаправленийДеятельности.ГосударственныйКонтракт Тогда

		НепроверяемыеРеквизиты.Добавить("УполномоченныйБанк");
		НепроверяемыеРеквизиты.Добавить("КодСпособаОпределенияПоставщика");
		НепроверяемыеРеквизиты.Добавить("КодГосударственногоЗаказчика");
		НепроверяемыеРеквизиты.Добавить("ПорядковыйНомер");
		НепроверяемыеРеквизиты.Добавить("ДополнительныеРазряды");

		Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
			ПроверяемыеРеквизиты.Добавить("Организация");
		КонецЕсли;

	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры
